In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
np.random.seed(1)

In [4]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

In [5]:
np.random.rand(3, 5)

array([[4.17022005e-01, 7.20324493e-01, 1.14374817e-04, 3.02332573e-01,
        1.46755891e-01],
       [9.23385948e-02, 1.86260211e-01, 3.45560727e-01, 3.96767474e-01,
        5.38816734e-01],
       [4.19194514e-01, 6.85219500e-01, 2.04452250e-01, 8.78117436e-01,
        2.73875932e-02]])

In [6]:
np.round(np.random.rand(3, 5), 2)

array([[0.67, 0.42, 0.56, 0.14, 0.2 ],
       [0.8 , 0.97, 0.31, 0.69, 0.88],
       [0.89, 0.09, 0.04, 0.17, 0.88]])

In [7]:
np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)])

array([['A', 'B', 'C', 'D', 'E'],
       ['0.1', '0.42', '0.96', '0.53', '0.69'],
       ['0.32', '0.69', '0.83', '0.02', '0.75'],
       ['0.99', '0.75', '0.28', '0.79', '0.1']], dtype='<U32')

In [8]:
np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T

array([['A', '0.45', '0.02', '0.05'],
       ['B', '0.91', '0.68', '0.57'],
       ['C', '0.29', '0.21', '0.15'],
       ['D', '0.29', '0.27', '0.59'],
       ['E', '0.13', '0.49', '0.7']], dtype='<U32')

In [9]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T,
                  columns=['C1', 'C2', 'C3', 'C4'])

In [10]:
df1

  C1    C2    C3    C4
0  A   0.1  0.54   0.9
1  B  0.41  0.66  0.14
2  C  0.69  0.51  0.14
3  D  0.41  0.94  0.81
4  E  0.05  0.59   0.4

In [11]:
df2 = df1.set_index('C1')

In [12]:
df2

      C2    C3    C4
C1
A    0.1  0.54   0.9
B   0.41  0.66  0.14
C   0.69  0.51  0.14
D   0.41  0.94  0.81
E   0.05  0.59   0.4

In [13]:
df3 = df2.set_index('C3')

In [14]:
df3

        C2    C4
C3
0.54   0.1   0.9
0.66  0.41  0.14
0.51  0.69  0.14
0.94  0.41  0.81
0.59  0.05   0.4

In [15]:
df1

  C1    C2    C3    C4
0  A   0.1  0.54   0.9
1  B  0.41  0.66  0.14
2  C  0.69  0.51  0.14
3  D  0.41  0.94  0.81
4  E  0.05  0.59   0.4

In [16]:
df1.set_index(['C1', 'C2'])

           C3    C4
C1 C2
A  0.1   0.54   0.9
B  0.41  0.66  0.14
C  0.69  0.51  0.14
D  0.41  0.94  0.81
E  0.05  0.59   0.4

In [17]:
df2

      C2    C3    C4
C1
A    0.1  0.54   0.9
B   0.41  0.66  0.14
C   0.69  0.51  0.14
D   0.41  0.94  0.81
E   0.05  0.59   0.4

In [18]:
df4 = df2.reset_index()

In [19]:
df4

  C1    C2    C3    C4
0  A   0.1  0.54   0.9
1  B  0.41  0.66  0.14
2  C  0.69  0.51  0.14
3  D  0.41  0.94  0.81
4  E  0.05  0.59   0.4

In [20]:
df3

        C2    C4
C3
0.54   0.1   0.9
0.66  0.41  0.14
0.51  0.69  0.14
0.94  0.41  0.81
0.59  0.05   0.4

In [21]:
df5 = df3.reset_index()

In [22]:
df5

     C3    C2    C4
0  0.54   0.1   0.9
1  0.66  0.41  0.14
2  0.51  0.69  0.14
3  0.94  0.41  0.81
4  0.59  0.05   0.4

In [23]:
df2

      C2    C3    C4
C1
A    0.1  0.54   0.9
B   0.41  0.66  0.14
C   0.69  0.51  0.14
D   0.41  0.94  0.81
E   0.05  0.59   0.4

In [24]:
df6 = df2.reset_index(drop=True)

In [25]:
df6

     C2    C3    C4
0   0.1  0.54   0.9
1  0.41  0.66  0.14
2  0.69  0.51  0.14
3  0.41  0.94  0.81
4  0.05  0.59   0.4